:SETUP:
#+TITLE: Code and Methods for Estimating Neediness
#+AUTHOR: Ethan Ligon
#+PROPERTY: header-args:python :results output :noweb no-export :exports none :comments link :prologue (format "# Tangled on %s" (current-time-string))
:END:

*** Order matters when data is missing!
By moving observations with  more missing data to the "end" of the
thin matrix, we (invariably?) obtain better approximations if we use
the updating SVD approach.

#+BEGIN_SRC python :var percent_missing=0.2 :var N=20 :tangle foo.py
  <<df_utils>>
  <<svd_rank1_approximation_with_missing_data>>

  def random_rank1_matrix(n=100,m=2):
      a=np.random.random(size=(n,1))
      a=a/np.linalg.norm(a)
      b=np.random.random(size=(m,1)).T
      b=b/np.linalg.norm(b)

      return a.dot(b)

  np.random.seed(0)
  d=[]
  
  for i in range(N):
      #print i
      X0=pd.DataFrame(random_rank1_matrix(n=100,m=4))
      X=X0.copy()
      X.iloc[np.random.random_sample(X.shape)<percent_missing]=np.nan

      Xhat0=svd_rank1_approximation_with_missing_data(X,return_usv=False,VERBOSE=False,MISSLAST=False)
      Xhat1=svd_rank1_approximation_with_missing_data(X,return_usv=False,VERBOSE=False,MISSLAST=True)

      d.append(df_norm(Xhat0-X0)/np.linalg.norm(X0) - df_norm(Xhat1-X0)/np.linalg.norm(X0))

  d=np.array(d)
  print "Proportion (out of %d) for which approximation is better with missing values last is %5.4f." % (N,np.mean(d>0))

#+END_SRC

#+results:
: Proportion (out of 20) for which approximation is better with missing values last is 1.0000.

    
*** Test of Rank 1 SVD Approximation to Matrix with Missing Data

First, some code to check if approximation works for a simple, small
scale example.

#+name: svd_rank1_approximation_with_missing_data_example
#+begin_src python :noweb no-export :results output :var MISSLAST=1 :tangle svd_rank1_approximation_with_missing_data_example.py
import numpy as np
import pandas as pd
<<svd_rank1_approximation_with_missing_data>>

(n,m)=(3,5)
a=np.random.normal(size=(n,1))
b=np.random.normal(size=(1,m))
e=np.random.normal(size=(n,m))*1e-2

X0=np.array([[-0.22,  0.32, -0.43],
             [0.01, 0.00,  0.00],
             [-0.22,  0.31, -0.42],
             [0.01, -0.03,  0.04],
             [-0.21, 0.31, -0.38]])

X0=X0-X0.mean(axis=1).reshape((-1,1))

X=X0.copy()
X[0,0]=np.nan
X[0,1]=np.nan

X0=pd.DataFrame(X0).T
X=pd.DataFrame(X).T

Xhat=svd_rank1_approximation_with_missing_data(X,VERBOSE=False,MISSLAST=MISSLAST)

print X
print X0
print Xhat
print "MISSLAST=%s" % MISSLAST
#+end_src

#+results: svd_rank1_approximation_with_missing_data_example
#+begin_example
      0     1     2     3     4
0   NaN  0.01 -0.22  0.01 -0.21
1   NaN  0.00  0.31 -0.03  0.31
2 -0.43  0.00 -0.42  0.04 -0.38
      0     1     2     3     4
0 -0.22  0.01 -0.22  0.01 -0.21
1  0.32  0.00  0.31 -0.03  0.31
2 -0.43  0.00 -0.42  0.04 -0.38
          0         1         2         3         4
0 -0.223967  0.001319 -0.217683  0.019239 -0.204965
1  0.323213 -0.001904  0.314145 -0.027764  0.295791
2 -0.429781  0.002532 -0.417723  0.036918 -0.393317
MISSLAST=1
#+end_example

#+name: svd_rank1_approximation_with_missing_data_test
#+begin_src python :noweb no-export :results output :var n=12 :var m=2000 :var percent_missing=0.5 :var SEED=0 :var MISSLAST=0 :tangle svd_rank1_approximation_with_missing_data_test.py
import numpy as np
import pandas as pd
<<svd_rank1_approximation_with_missing_data>>

if SEED:
    np.random.seed(SEED)

a=np.random.normal(size=(n,1))
b=np.random.normal(size=(1,m))
e=np.random.normal(size=(n,m))*1e1

X0=np.outer(a,b)
X0=X0-X0.mean(axis=0)

X=X0.copy()
X[np.random.random_sample(X.shape)<percent_missing]=np.nan

X0=pd.DataFrame(X0).T
X=pd.DataFrame(X).T

Xhat,u,s,v=svd_rank1_approximation_with_missing_data(X,VERBOSE=False,MISSLAST=MISSLAST,return_usv=True)
Xhat1,u1,s1,v1=eig_svd_rank1_approximation_with_missing_data(X,VERBOSE=False,return_usv=True)

rho=pd.concat([X.stack(dropna=False),Xhat.stack()],axis=1).corr().iloc[0,1]
rho1=pd.concat([X.stack(dropna=False),Xhat1.stack()],axis=1).corr().iloc[0,1]
missing=np.isnan(X.as_matrix()).reshape(-1,1).mean()
print "Proportion missing %g and correlations are %5.4f and %5.4f" % (missing, rho,rho1),
print "MISSLAST=%s" % MISSLAST,
print "Singular value=%g" % s,
print "Singular value=%g" % s1[0],
if SEED: print "Seed=%g" % SEED
else: print
#+end_src

#+results: svd_rank1_approximation_with_missing_data_test

#+CALL: svd_rank1_approximation_with_missing_data_test(percent_missing=0.85,SEED=21,MISSLAST=0) :results prepend

#+results:


#+BEGIN_SRC python :var percent_missing=0.6 :var MISSLAST=1 :tangle baz.py
(n,m)=(12,1000)

SEED=0
rho=1
lowrho=(2,SEED)
while rho>0: 
    SEED+=1
    <<svd_rank1_approximation_with_missing_data_test>>
    if rho<lowrho[0]: lowrho=(rho,SEED)

#+END_SRC

#+BEGIN_SRC python :var percent_missing=0.6 :var MISSLAST=1 :tangle foo.py

SEED=17

(n,m)=(4,8)

<<svd_rank1_approximation_with_missing_data_test>>

#+END_SRC

#+results:
: Proportion missing 0.5625 and correlation 0.4696 MISSLAST=1 Singular value=8.15501 Seed=17

: Proportion missing 0.53125 and correlation 0.0389 MISSLAST=1 Singular value=13.2579 Seed=80





